<?php
/************************** ОПЕРАТОРЫ ****************************/

# Условный оператор "?"" ---------------------------------------------
$val = 5;
$output = ($val > 5) ? "Value more than 5" : "Value less than 5 or equal";	//если $val больше 5, то $output равен 1му значению 
																			//"Value more than 5", иначе второму "Value less than 5 or equal"

# Условный оператор "?:" позволяет опускать первое значени(вместо $x ? $x : $y мы имеем $x ?: $y). В ниженаписанном коде проверяется
# переменная (в данном случае $num) инициализированна ли она, т.е. ее значение должно быть отлично от 0, null, false, ""
# (все что может расцениваться как FALSE) и если да, то она остается с прежним значением, если же нет, 
# ей присваивается знаение "empty".
$num = null;
$val = $num ?: "empty";
echo $val;
//Важно понимать, что если проверяемая переменная (в нижепреведенном коде $num) не объявлена и не имеет никакого значения 
// вообще(ни 0, null) то интерпретатор выдаст ошибку о том что переменная не объявлена. Если мы не знаем существует ли переменная, 
// то нужно использовать конструкцию "??".
$val = $num ?: "empty"; // $val будет равно "empty", т.к. переменная $num не объявлена ранее
echo $val;

# "??" проверяет переменную на существование и если она существует и не равна 0, null, false, ""(все что может расцениваться как FALSE) то оставляет её значение как есть, иначе присваивает значение указанное нами
$val = 5;
$message = $newNew ?? $val;//если есть $newNew то $message равно $newNew, иначе $message равно "5"
echo $val;//выведет 5

//то же что и выше но с помощью обычной когструкции if
if (isset($newNew)) $new_message = $newNew;
else $new_message = $val;
echo $val;//выведет 5

//пример ??
$z = "string";
$string = $x ?? $y ?? $z;
echo $string;//выведет переменную $z т.к. первые две не существуют

$a = 15;
$a = $a % 2 == 0 ? $a : "even"; //вернет ODD
$a = $a % 2 == 0 ?: "even";     //вернет ODD


/****************ОПЕРАТОРЫ АЛЬТЕРНАТИВНЫЙ СИНТАКСИС*****************/
/*Вместо <?php echo $content ?> можно писать <?=$content?>*/

#------ if -----------
if (condition):
	//some code;
	//some code;
elseif (condition):
	//some code;
	//some code;
else:
	echo "something";
	echo "something";
endif;

#------ while ------
while (condition):
	//some code;
	//some code;
endwhile;

#-------for----------
for ($i=0; $i < 10; $i++):
	//some code;
	//some code;
endfor;

#------foreach---------
foreach ($variable as $key => $value):
	//code
endforeach;

#-------swith----------
switch (variable): 
	case 'value':
		# code...
		break;
	default:
		# code...
		break;
endswitch;