<?php
//=========================== Математические функции =============================
abs(-15); //возвращаем модуль числа (всегда положительное число)

#-----------------------------Округление-------------------------------------
round(3.4);//округляет число по математическим стандартам, но если оно отрицительное, то всегда округляем так: -4.3 = -4(что больше чем -4.3), -4.6 = -5 (что меньше 4.6). Также есть параметры округления. см. доки 
ceil(4.5);//всегда округляем вверх = 5
floor(4.5);//всегда округляем вниз = 4

#----------------------------Случайные числа----------------------------------
echo mt_rand(1, 1500)."<br>";//можно указать вместо 1500, RAND_MAX
echo mt_getrandmax();//показывает максимальное допустимое число для mt_rand

#----------------------------Min & Max-----------------------------------------
$values = [1,4,6,8,9];
min($values);//веннет минимальное значение, вместо массива можно указывать агрументы через запятую min(3,9,8,0), но если есть массив он должен быть единственным аргументом
max($values);//веннет максимальное значение, вместо массива можно указывать агрументы через запятую, но если есть массив он должен быть единственным аргументом