<?php 
#============================БЛОКИРОВКА ФАЙЛОВ================================
flock($file, $operation);//блокирует файл, где 
/*
 LOCK_SH (или 1) - разделяемая блокировка
 LOCK_EX (или 2) - исключительная блокировка
 LOCK_UN (или 3) - снятьблокировку
 LOCK_NB (или 4) - читай доки
*/

//---------------ПРАВИЛЬНАЯ БЛОКИРОВКА !!! ---------------
//ВАЖНО СНИМАТЬ БЛОКИРОВКУ КАК МОЖНО РАНЬШЕ
/*
LOCK_EX (или 2) - исключительная блокировка, дает доступ к файлу только одному процессу в данный момент времени и неважно, процесс пишет или читает файл, идеально подходит для ПИСАТЕЛЯ, т.к. блокирует все процессы в то время как данные пишуться в файл, если бы ЧИТАТЕЛЬ пытался прочитать в данный момент файл, он был бы битым, а другой писатель испортил бы файл.

LOCK_SH (или 1) - разделяемая блокировка хороша для процесса ЧИТАТЕЛЯ, т.к. она не препятствует другим процессам которые читают файл, а ведь если их очень много, то при исключительной блокировке их очередь становится очень большой и падает производительность. Если появится процесс с исключительной блокировкой, то все читатели пбудут приостановлены пока процесс работает, а как только он закончится скопом кинуться читать данный файл

*/

#----------------Для процесса "ПИСАТЕЛЯ"-----------------
 //важно также не использовать режимы "w","w+" ни в коем случае, т.к. он удаляет файл если таковой существует до того как произойдет блокировка файла, а не после
 $file = fopen("/some.txt", "r+b") or die("I can't open file");
 flock($file, LOCK_EX);
 //some code
 fclose($file);

 //соответственно, если нам каждый раз нужно стирать файл при открытии, то делаем так:
 $file = fopen("/some.txt", "r+") or die("I can't open file");
 flock($file, LOCK_EX);
 ftruncate($file, 0); //усекаем файл до 0-го размера
 //some code
 fclose($file);

 //Иногда полезно снимать блокировку с файла, например для передачи права записи другому процессу, пока скрипт простаивает и например ждет данных для записи. Но перед разблокировкой обязательно нужно отправить данные в файл.
 $file = fopen("/some.txt", "r+b") or die("I can't open file");
 flock($file, LOCK_EX);
 //some code
 fflush($file);//отправили данные из буфера
 flock($file, LOCK_UN);//сняли блок
 //some code
 fclose($file);

 #----------------Для процесса "ПИСАТЕЛЯ"----------------------

 fclose(fopen('/some.txt', 'a+b'));		//создали файл если его нет. Если же файл существует, это его не разрушит.
 $file = fopen('/some.txt', 'rb');
 flock($file, LOCK_SH);
 //some code
 fclose("/some.txt");