<?php

printf("String: %05d", 234);
echo '<hr>';
printf("String: %5d", 234);
echo '<hr>';
printf("String: %010.2f", 234.456);

//   [%Заполнитель]        [-]           [Размер]      [.Точность]          [Тип]
//	      %   	         сторона          кол-во 		 кол-во 	      s(string), d(digit), f(float),...
// (или 'любой символ)  заполнения       знакомест	знакомест за точкой

printf("%'#5s", "dfg")	;		//##dfg 
echo '<hr>';
//  0                    7             2              f
printf("%07.2f", "12.342")	;	//0012.34 
printf("%*-7.2f", "12.342");	//12.34** 