<?php
//выведет количество секунд от 1 января 1970г до текущего момента
echo time()."<br>"; 

//выведет количество секунд от 1 января 1970г до текущего момента + неделя вперед
echo time() + (7 * 24 * 60 * 60)."<br>"; 

//практически тоже что и time()- возвращает кол-во секунд до указанной даты от 1970
$hour = 0; $minute = 50; $second = 30; $month = 5; $day = 3; $year = 2017;
//если опущены какие-либо данные, то функция возьмет их из текущего времени
echo mktime($hour, $minute, $second, $month, $day, $year)."<br>";

//выведет текущую дату в формате Д-М-Г
echo date("d-m-Y")."<br>";

//проверка допустимости даты
$day = 30;
$month = 2;
$year = 1984;
// выведет, что дата не верна,т.к. в феврале не может быть 30 дней
if (checkdate($month, $day, $year)) "Допустимая дата";
else    echo 'Дата не верна';

