<?php

/* 
 * Побочным эффектом называют любые действия изменяющие среду выполнения. 
 * К ним относятся любые файловые операции, такие как запись в файл, отправка или приём данных по сети, 
 * даже вывод в консоль или чтение файла. Кроме того, побочными эффектами считаются обращения к 
 * глобальным переменным (как на чтение, так и запись) и изменение входных аргументов в случае, 
 * когда они передаются по ссылке. Вызов функции с побочными эффектами также считается побочным эффектом.
 */
function sayHiTo($name)
{
    print_r("Hi, {$name}");
}

/*
 * С другой стороны, любые вычислительные операции не являются побочными эффектами. Например, функция, 
 * суммирующая два переданных аргументами числа.
 */
function sum($num1, $num2)
{
    return $num1 + $num2;
}